In [1]:
import pandas as pd

In [2]:
raw = [23.4, 54.3, 34.5, 9.0, 22.3]

In [7]:
data = pd.Series(raw, index=['M', 'T', 'W', 'Th', 'F'])
data

M     23.4
T     54.3
W     34.5
Th     9.0
F     22.3
dtype: float64

In [11]:
df = pd.DataFrame({'name':['a','b','c'], 'x':[10,15,29]})
df

  name   x
0    a  10
1    b  15
2    c  29

In [13]:
df['y'] = df.x * 2
df

  name   x   y
0    a  10  20
1    b  15  30
2    c  29  58

In [14]:
def f(x, y):
    return x + y**2

In [17]:
df['fxy'] = f(df.x, df.y)
df

  name   x   y   fxy
0    a  10  20   410
1    b  15  30   915
2    c  29  58  3393

In [18]:
x_series = df.x
y_series = df.y

In [19]:
x_series

0    10
1    15
2    29
Name: x, dtype: int64

In [20]:
y_series * 2

0     40
1     60
2    116
Name: y, dtype: int64